""" Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) | """
a = int(input())
if a >= 100:
    b = a % 10
    c = a // 100
    d = a % 100 
    e = d // 10
print ( b + c + e)


